#+TITLE: Chapter 3 Exercises
#+SUBTITLE: Fundamental Concepts of Dynamics
#+DESCRIPTION: Mathematical Methods in Engineering, Karman and Biot
#+AUTHOR: Jason Ross
#+OPTIONS: toc:nil num:t numeq:nil syntax:vim
#+CONTEXT_PRESET: article
# #+CONTEXT_HEADER_EXTRA: \setuppapersize[letter]
#+CONTEXT_HEADER_EXTRA: \setupformulae[grid=both]
#+CONTEXT_HEADER_EXTRA: \setuplayout[grid=both]
#+CONTEXT_SNIPPET: headfoot-homework colors-pigmints
#+CONTEXT_HEADER_EXTRA: \registerunit[unit][poundforce=poundforce, poundmass=poundmass]
#+CONTEXT_HEADER_EXTRA: \setupunittext[poundforce=lbf, poundmass=lbm]
#+CONTEXT_HEADER_EXTRA: \setupunittext[poundforce=lbf, poundmass=lbm]
#+CONTEXT_HEADER_EXTRA: \setupdescription[OrgDesc][align=width]
#+DATE: 2020-01-13

  #+BEGIN_EXPORT metapost
  input dims;
  input outlinepath;
  #+END_EXPORT

** TODO Problem 7
- Problem Statement :: A top consists of a circular disk mounted on a spindle
  that has one fixed point and is free to assume all directions around the
  point. The disk revolves around the spindle at
  \unit{ 800 revolution/minute },
  its mass is \unit{2 poundmass}, its diameter is \unit{10 inch}, and its
  distance from the fixed point is \unit{8 inch}. If the spindle is assumed to
  make an angle of \unit{30 degree} with the vertical, what are the two speeds
  of precession? What are these speeds if the spindle is horizontal?

- Solution :: The moment of inertia of the disk about the spindle axis $\zeta$
  is simply $C = \frac{m r^2}{2}$. The moment of inertia of the disk about the
  $\xi$ axis is $A = \frac{m r^2}{4} + l^2 m$. Let $\mu$ be the rate of
  precession of the gyroscope about the $y$ axis and $\Omega$ be the rate of
  rotation of the gyroscope. Then the total angular momentum of the gyroscope
  about the $\zeta$ axis is $H_{\zeta} = \Omega C + \mu C \cos\theta$ and the
  angular momentum about the $\xi$ axis is $H_{\xi} = \mu A \sin\theta$.

  The moment applied to the top is equal to the weight of the top times
  the horizontal distance from the point of the top to its center of mass
  times the weight of the top.

  $$M = m g l \sin{\theta} \hat{\psi}$$

  The vector quantity of the angular momentum of the top is

  $$\bar{H} = C \left( \Omega + \mu \cos{\theta} \right) \hat{\zeta} +
  A \mu \sin{\theta} \hat{\xi}$$

  We have by definition, $\frac{d\bar{H}}{dt} = \bar{M}$.

  $$\frac{d\bar{H}}{dt} = C \left( \Omega + \mu \cos{\theta} \right)
  \frac{d \hat{\zeta}}{dt} + A \mu \sin{\theta} \frac{d \hat{\xi}}{dt}$$

  The rate of change of a unit vector in a rotating reference frame is equal
  to the cross product of the angular velocity of the reference frame with
  the unit vector:

  \begin{align*}
  \frac{d\hat{\zeta}}{dt} &= \bar{\mu} \times \hat{\zeta} \\
  \bar{\mu} &= \mu \cos{\theta} \hat{\zeta} + \mu \sin{\theta} \hat{\xi} \\
  \bar{\mu} \times \hat{\zeta} &= \mu \sin{\theta} \hat{\psi} \\
  \frac{d\hat{\xi}}{dt} &= \bar{\mu} \times \hat{\xi} \\
  &= -\mu \cos{\theta} \hat{\psi}
  \end{align*}

  Therefore, the rate of change of angular momentum is

  $$\frac{d\bar{H}}{dt} = C \left( \Omega + \mu \cos{\theta} \right)
  \mu \sin{\theta}\hat{\psi} - A \mu \sin{\theta}
  \mu \cos{\theta}\hat{\psi} = m g l \sin{\theta} \hat{\psi}$$

  We can start substituting terms back in:

  \begin{align*}
  C (\Omega + \mu \cos{\theta}) \mu - A \mu^2 \cos{\theta} &= m g l \\
  \frac{m r^2}{2} \Omega \mu + \frac{m r^2}{2} \mu^2 \cos{\theta} -
  \frac{m r^2}{4} \mu^2 \cos{\theta} - l^2 m \mu^2 \cos{\theta} &= m g l \\
  \frac{r^2}{2} \Omega \mu + \frac{r^2}{2} \mu^2 \cos{\theta} -
  \frac{r^2}{4} \mu^2 \cos{\theta} - l^2 \mu^2 \cos{\theta} &= g l \\
  \frac{r^2}{2} \Omega \mu + \frac{r^2}{4} \mu^2 \cos{\theta} -
  l^2 \mu^2 \cos{\theta} &= g l \\
  2 r^2 \Omega \mu + r^2 \mu^2 \cos{\theta} -
  4 l^2 \mu^2 \cos{\theta} &= 4 g l \\
  2 r^2 \Omega \mu + \mu^2 \cos{\theta} (r^2 - 4 l^2) &= 4 g l \\

  \end{align*}



#+BEGIN_SRC jupyter-python :session py :results both :pandoc t :exports both
from sympy import *
var("r Omega mu theta l g")
vals = {
    r: 5,
    Omega: 800 * 2 * pi / 60,
    theta: pi / 6,
    l: 8,
    g: 32.2*12
}
to_solve = (
    2 * r**2 * Omega * mu
    + mu**2 * cos(theta) * (r**2 - 4 * l**2)
    - 4 * g * l
)
soln = solve(to_solve, mu)
display(soln[0].subs(vals).evalf() * 60 / (2 * pi.evalf()))
display(soln[1].subs(vals).evalf() * 60 / (2 * pi.evalf()))
#+END_SRC

#+RESULTS:
:RESULTS:
$\displaystyle 165.993797825493$
$\displaystyle 33.9543473484036$
:END:

If $\theta = \frac{\pi}{2}$, we have a linear equation:

\begin{align*}
2 r^2 \Omega \mu  &= 4 g l \\
\mu &= \frac{2 g l}{r^2 \Omega}
\end{align*}

#+BEGIN_SRC jupyter-python :session py :results both :pandoc t :exports both
solve(
    to_solve.subs(theta, pi/2), mu
)[0].subs(vals).evalf() * 60 / (2 * pi.evalf())
#+END_SRC

#+RESULTS:
:RESULTS:
$\displaystyle 28.1883638587675$
:END:

